/*
1. Запросіть у користувача його ім’я та виведіть у відповідь
«Привіт, (його ім’я)!».
*/

let userName = prompt("enter Your Nickname: ");
alert(`Привіт,  ${userName} !`);



/*
2. Запросіть у користувача його рік народження, підрахуйте
скільки йому років і виведіть результат. Поточний рік
вкажіть у коді як константу.
*/

// let userOld = +prompt("Якого Ви року народження?");
// const currentYear = 2023;
// let res = currentYear - userOld;
// if (res >= 18 && res <= 60) {
//     alert(`Вітаємо!!! Ви підлягаєте загальній моболізації)))) повних/не повних років ${res}.`);
// } else if (res <= 18) {
//     alert(`ВЧИСЬ!!!`);
// } else {
//     alert(`Пий Валер’янку`);
// }



/*
3. Запросіть у користувача довжину сторони квадрата та
виведіть його периметр.
*/


// let a = +prompt("Ввведіть довжину відомої сторони квадрата: ");
// res = a + a + a + a;
// alert(`Периметр квадрата дорівнює ${res}`);


/*
4. Запросіть у користувача радіус кола та виведіть його площу
*/

// const pi = 3.14;
// let r = +prompt("Для визначення площі кола введіть радіус: ");
// let s = pi * (r * 2);
// alert(`За r=${r} площа кола становить ${s}`);



/*
5. Запросіть у користувача відстань у кілометрах між двома
містами та за скільки годин він хоче дістатися. Порахуйте
швидкість, з якою потрібно рухатися, щоб встигнути вчасно.
*/
// let s = +prompt("Введіть відстань між точкою A та B: (км) / Відстань від Рівного до Києва становить 325км/");
// let t = +prompt("Введіть бажаний час подалання відстані між  точкою A та B: (год)");

// v = s / t;
// alert(`Бажана швидкість ${v} (км/год) для подолання відстані ${s} кілометрів за вказаний час ${t} годин `);



/*
6. Реалізуйте конвертор валют. Користувач вводить долари,
програма конвертує у євро. Курс валюти зберігайте у константі.
*/

// let dollars = +prompt("Введіть кількість долларів, для конвертації y євро ");
// const exchangeRate = 0.93;
// let res = dollars * exchangeRate;
// alert(`${res}, можливо краще в кріпту)))`);


/*
7. Користувач вказує обсяг флешки у ГБ. Програма має підрахувати скільки файлів розміром 820 МБ вміститься на
флешку.
*/

// let size = +prompt("Введіть обсяг флешки у ГБ для розрахунку, результат видасть МАКСИМАЛЬНУ вмісткість файлів та залишок  вмісткості кількості файлів!");
// const gb = 1024;
// let file = 820;
// let res = (size * gb) / 820;
// // let empty = res - Math.floor(res);
// let empty = (size * gb) -(Math.floor(res) * 820);
// alert(`${Math.floor(res) }, стільки файлів розміром 820 МБ вміститься на
// флешку розміром ${size}. ${empty}MB залишиться не задіяними.`);


/*
8. Користувач вводить суму грошей у гаманці та вартість
однієї шоколадки. Програма виводить скільки шоколадок
може купити користувач і скільки здачі в нього залишиться.
*/

// let sum = +prompt("Введіть баланс гаманця ГРН.КОП для розрахунку, результат видасть кількість шоколадок та залишок у ГРН.КОП");
// let choko = +prompt("Введіть вартість шоколадки: ГРН.КОП");
// let res = sum / choko;
// let balance = sum - (Math.floor(res) * choko);
// alert(`${Math.floor(res)}, стільки шоколадок можна купити на
// суму розміром ${sum} ГРН.КОП. Баланс після покупки ${(balance).toFixed(1)} ГРН.КОП`);




/*
9. Запросіть у користувача тризначне число і виведіть його
паліндром (число-перевертень). Для вирішення завдання
вам знадобиться оператор % (залишок від ділення).
*/

// let numbners = +prompt("Введіть тризначне число");
// console.log(numbners);

// let a = numbners % 10;

// let b = (numbners / 10) % 10;

// let c = numbners / 100;

// console.log('${a}', Math.floor(a));
// console.log('${b}',  Math.floor(b));
// console.log('${c}', Math.floor(c));

// let res =`${Math.floor(a)}${Math.floor(b)}${Math.floor(c)}`;
// alert(res);



/*
10. Запросіть у користувача ціле число і виведіть у відповідь
парне або непарне. В завданні використовуйте логічні
оператори і не використовуйте if та switch.
*/

// let numbners = +prompt("Введіть ціле число");
// let res = numbners % 2 ;
// let mes = res > 0  ? "непарне" : "парне";
// alert(mes);